##############################################
# Data Type
"""
- Data Type은 크게 기본형(Primitive Type)과 참조형(Reference Type)으로 구분된다.
1) 기본형
    - 값을 변수에 직접 저장하는 자료형
2) 참조형
    - 값을 직접 저장하지 않고, 값이 저장된 주소를 저장하는 자료형
    ex> Class a = new Class();

=> Python의 모든 Data Type은 참조형으로 Class로 구성되어 있다!!!



- Python 기본 Data Type
| Data Type | Description           | Example                               |
|-----------|-----------------------|---------------------------------------|
| int       | 정수형 데이터          | a = 100   # 0xFF(16진수), Oo56(8진수)  |
| float     | 소수점을 포함한 실수형  | a = 10.25                             |
| complex   | 복소수                 | a = 3 + 1j                            |
| str       | 문자열                 | a = "abc"                             |
| bool      | 참, 거짓               | a = True   # False                    |
| None      | Null                  | a = None                              |


- Python 자료구조
1) list
2) tuple
3) set
4) dictionary
"""
print("---------- Data Type ----------")



##############################################
# 1. Numbers
"""
- Python이 지원하는 수에는 정수(Integer), 실수(Real Number), 복소수(Complex Number) 3가지가 있다.
    => 그 외로 Class Decimal 이나 Class Fraction 등을 지원(2, 8, 16 진수 표현)

1) 정수 (Integer)
    - 메모리가 허용하는 선에서 무한대의 정수를 사용    
    => Data Type : int
2) 실수 (Real Number)
    - 8 바이트 크기의 부동 소수형 제공
    - 소수점 15자리까지 표현된다.
    - 정밀한 계산을 하기는 힘들다.
    => Data Type : float
3) 복소수 (Complex Number)
    - "a + bj" 와 같이 표현
    => Data Type : complex
"""
print("---------- Numbers ----------")

a = 2
print(type(a))

b = 3.15
print(type(b))

v = 2 + 3j
v.real    # 2
v.imag    # 3
print(type(v))
print(type(v.real))
print(type(v.imag))



##############################################
# 2. Boolan
"""



"""
print("---------- Numbers ----------")







##############################################
# 1. 
"""



"""
print("---------- Numbers ----------")


##############################################
# 1. 
"""



"""
print("---------- Numbers ----------")


##############################################
# 1. 
"""



"""
print("---------- Numbers ----------")


##############################################
# 1. 
"""



"""
print("---------- Numbers ----------")


##############################################
# 1. 
"""



"""
print("---------- Numbers ----------")


##############################################
# 1. 
"""



"""
print("---------- Numbers ----------")


##############################################
# 1. 
"""



"""
print("---------- Numbers ----------")


##############################################
# 1. 
"""



"""
print("---------- Numbers ----------")